Computer_Networking_A_Top_Down_Approach/001.Computer_Networks_and_the_Internet/001.000.Notes.org
#+title: Chapter 1: Computer Networks & the Internet
#+author: Alfredo Mejia
#+options: num:nil html-postamble:nil
#+html_head: <link rel="stylesheet" type="text/css" href="../../resources/bulma/bulma.css" /> <style>body {margin: 5%} h1,h2,h3,h4,h5,h6 {margin-top: 3%}</style>

* Navigation
| Nav   | Title                                    | Links                                   |
|-------+------------------------------------------+-----------------------------------------|
| Index | Notes Home                               | \vert [[file:../../index.html][html]] \vert [[file:../../index.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main][github]] \vert |
| Home  | Computer Networking: A Top Down Approach | \vert [[file:../000.Home.html][html]] \vert [[file:../000.Home.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Computer_Networking_A_Top_Down_Approach][github]] \vert |
| Prev  |                                          |                                         |
| Next  | Chapter 2: Application_Layer             | \vert [[file:../002.Application_Layer/002.000.Notes.html][html]] \vert [[file:../002.Application_Layer/002.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Computer_Networking_A_Top_Down_Approach/002.Application_Layer][github]] \vert |

* Notes

** Section 1.0: Introduction
   - The internet largest network engineered by mankind
   - The internet is a network of networks
   - Is possible to understand such complexity? YES! It is possible

** Section 1.1: What is the Internet?
   - When talking about the internet, we refer to the public interent
   - The internet can be described as the basic hardware and software components (the nuts & bolts of the internet)
   - You can also describe the internet in terms of a networking infrastructure that provides services to distributed applications

*** Section 1.1.1: A Nuts and Bolts Description
    - All of the devices connected to the internet are called hosts or end systems
    - End systems are connected together by a network of communication links and pakcet switches
    - There are many different types of communication links which are made up of different physical medias such as coaxial cable, copper wire, optical fiber, and radio spectrum
    - Each physical media transmit data at different rates called transmission rates
    - Transmission rates are measured in bits per second

**** Section 1.1.1.1: How Data is Sent
     - When one end-system sends data to another end-system, the sending host segments the data and adds header bytes to each segment
     - The segments then become part of network packets that are sent through the network to the destination end-system
     - In the end-system then receives the packets and reassembles the segments into the original data

**** Section 1.1.1.2: Packet Switches
     - A packet switch takes a packet arriving on one of its incoming communication links and forwards that packet on one of its outgoing communication link
     - Packet switches come in many different types of shapes and flavors but the most common today's Internet are routers and link-layer switches
     - Link-layer switches are typically used to access networks
     - Routers are typically used in the network core
     - The sequence of communication links and packet switches traversed by a packet from the sending end system to the receiving end system is known as a route or path through the network
     - Think of it like this: we have a cargo split into different trucks which then deliver it to a building which the cargo is reassembled and grouped
     - The initial building was the sending host, the packets are the trucks, the highways and roads are the communication links, the intersections are the packet switches (where to turn left or right), and the other building is the receiving host
     - The trucks takes a path through the network just like a packet takes a path through a computer network

**** Section 1.1.1.3: Internet Service Providers (ISPs)
     - End systems access the Internet through Internet Service Providers (ISPs) such as residential ISPs, mobile ISPs, corporate ISPs, university ISPs, etc.
     - Each ISP is in itself a network of packet switches and communication links and each ISP provide a variety of types of network access to the end systems (e.g. cable modem, mobile wireless access, etc.)
     - ISPs also provide Internet access to content providers such as servers which can communicate with other end-systems
     - Lower-tier ISPs are interconnected through national and international upper-tier ISPs and these upper-tier ISPs are connected directly to each other consisting of high-speed routers interconnected with high-speed fiber-optic links
     - Each upper-tier and lower-tier ISP network is managed indepedently and runs the IP protocol and conforms to certain naming and address conventions

**** Section 1.1.1.4: Internet Protocols
     - End systems, packet switches, and other pieces of the Internet run protocols that control the sending and receiving of information within  the Internet
     - The Transmission Control Protocol (TCP) and the Internet Protocol (IP) are two of the most important protocols in the Internet collectively known as TCP/IP
     - The IP protocol specifies the format of the packets that are sent and received among routers and end systems
     - When creating a protocol everyone must agree what each and every protocol does so that people can create systems and products that interoperate
     - This is where the Internet Standards are created by the Internet Engineering Task Force and the standard documents are called request for comments (RFCs)
     - The RFCs are technical and detail but define protocols such as TCP, IP, HTTP (for the web), and SMTP (for e-mail)
     - There are other bodies that also specify standards for network components such as network links
       
*** Section 1.1.2: A Services Description
       
* Keywords
| Term                | Definition |
|---------------------+------------|
| Host or End-System  |            |
| Segments            |            |
| Packets             |            |
| Packet Switches     |            |
| Link-Layer Switches |            |
| Routers             |            |
| IP Protocol         |            |
| TCP Protocol        |            |

* Questions
  - *Q*:

* Summary

* Resources
