Computer_Networking_A_Top_Down_Approach/001.Computer_Networks_and_the_Internet/001.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-03-18 Tue 10:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 1: Computer Networks &amp; the Internet</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../resources/bulma/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Chapter 1: Computer Networks &amp; the Internet</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3c62e2e">Navigation</a></li>
<li><a href="#org2ea06f6">Notes</a>
<ul>
<li><a href="#org0eaa4dd">Section 1.0: Introduction</a></li>
<li><a href="#org4bc0feb">Section 1.1: What is the Internet?</a>
<ul>
<li><a href="#org885fc9e">Section 1.1.1: A Nuts and Bolts Description</a></li>
<li><a href="#org7df2604">Section 1.1.2: A Services Description</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org70215cc">Keywords</a></li>
<li><a href="#org5a06995">Questions</a></li>
<li><a href="#org08a7a40">Summary</a></li>
<li><a href="#orgfb60913">Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3c62e2e" class="outline-2">
<h2 id="org3c62e2e">Navigation</h2>
<div class="outline-text-2" id="text-org3c62e2e">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../index.html">html</a> &vert; <a href="../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">Computer Networking: A Top Down Approach</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Computer_Networking_A_Top_Down_Approach">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Prev</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">Chapter 2: Application<sub>Layer</sub></td>
<td class="org-left">&vert; <a href="../002.Application_Layer/002.000.Notes.html">html</a> &vert; <a href="../002.Application_Layer/002.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Computer_Networking_A_Top_Down_Approach/002.Application_Layer">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2ea06f6" class="outline-2">
<h2 id="org2ea06f6">Notes</h2>
<div class="outline-text-2" id="text-org2ea06f6">
</div>
<div id="outline-container-org0eaa4dd" class="outline-3">
<h3 id="org0eaa4dd">Section 1.0: Introduction</h3>
<div class="outline-text-3" id="text-org0eaa4dd">
<ul class="org-ul">
<li>The internet largest network engineered by mankind</li>
<li>The internet is a network of networks</li>
<li>Is possible to understand such complexity? YES! It is possible</li>
</ul>
</div>
</div>

<div id="outline-container-org4bc0feb" class="outline-3">
<h3 id="org4bc0feb">Section 1.1: What is the Internet?</h3>
<div class="outline-text-3" id="text-org4bc0feb">
<ul class="org-ul">
<li>When talking about the internet, we refer to the public interent</li>
<li>The internet can be described as the basic hardware and software components (the nuts &amp; bolts of the internet)</li>
<li>You can also describe the internet in terms of a networking infrastructure that provides services to distributed applications</li>
</ul>
</div>

<div id="outline-container-org885fc9e" class="outline-4">
<h4 id="org885fc9e">Section 1.1.1: A Nuts and Bolts Description</h4>
<div class="outline-text-4" id="text-org885fc9e">
<ul class="org-ul">
<li>All of the devices connected to the internet are called hosts or end systems</li>
<li>End systems are connected together by a network of communication links and pakcet switches</li>
<li>There are many different types of communication links which are made up of different physical medias such as coaxial cable, copper wire, optical fiber, and radio spectrum</li>
<li>Each physical media transmit data at different rates called transmission rates</li>
<li>Transmission rates are measured in bits per second</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="orgb52f2ac"></a>Section 1.1.1.1: How Data is Sent<br />
<div class="outline-text-5" id="text-orgb52f2ac">
<ul class="org-ul">
<li>When one end-system sends data to another end-system, the sending host segments the data and adds header bytes to each segment</li>
<li>The segments then become part of network packets that are sent through the network to the destination end-system</li>
<li>In the end-system then receives the packets and reassembles the segments into the original data</li>
</ul>
</div>
</li>

<li><a id="org76f37e9"></a>Section 1.1.1.2: Packet Switches<br />
<div class="outline-text-5" id="text-org76f37e9">
<ul class="org-ul">
<li>A packet switch takes a packet arriving on one of its incoming communication links and forwards that packet on one of its outgoing communication link</li>
<li>Packet switches come in many different types of shapes and flavors but the most common today's Internet are routers and link-layer switches</li>
<li>Link-layer switches are typically used to access networks</li>
<li>Routers are typically used in the network core</li>
<li>The sequence of communication links and packet switches traversed by a packet from the sending end system to the receiving end system is known as a route or path through the network</li>
<li>Think of it like this: we have a cargo split into different trucks which then deliver it to a building which the cargo is reassembled and grouped</li>
<li>The initial building was the sending host, the packets are the trucks, the highways and roads are the communication links, the intersections are the packet switches (where to turn left or right), and the other building is the receiving host</li>
<li>The trucks takes a path through the network just like a packet takes a path through a computer network</li>
</ul>
</div>
</li>

<li><a id="org8f8b994"></a>Section 1.1.1.3: Internet Service Providers (ISPs)<br />
<div class="outline-text-5" id="text-org8f8b994">
<ul class="org-ul">
<li>End systems access the Internet through Internet Service Providers (ISPs) such as residential ISPs, mobile ISPs, corporate ISPs, university ISPs, etc.</li>
<li>Each ISP is in itself a network of packet switches and communication links and each ISP provide a variety of types of network access to the end systems (e.g. cable modem, mobile wireless access, etc.)</li>
<li>ISPs also provide Internet access to content providers such as servers which can communicate with other end-systems</li>
<li>Lower-tier ISPs are interconnected through national and international upper-tier ISPs and these upper-tier ISPs are connected directly to each other consisting of high-speed routers interconnected with high-speed fiber-optic links</li>
<li>Each upper-tier and lower-tier ISP network is managed indepedently and runs the IP protocol and conforms to certain naming and address conventions</li>
</ul>
</div>
</li>

<li><a id="org125edec"></a>Section 1.1.1.4: Internet Protocols<br />
<div class="outline-text-5" id="text-org125edec">
<ul class="org-ul">
<li>End systems, packet switches, and other pieces of the Internet run protocols that control the sending and receiving of information within  the Internet</li>
<li>The Transmission Control Protocol (TCP) and the Internet Protocol (IP) are two of the most important protocols in the Internet collectively known as TCP/IP</li>
<li>The IP protocol specifies the format of the packets that are sent and received among routers and end systems</li>
<li>When creating a protocol everyone must agree what each and every protocol does so that people can create systems and products that interoperate</li>
<li>This is where the Internet Standards are created by the Internet Engineering Task Force and the standard documents are called request for comments (RFCs)</li>
<li>The RFCs are technical and detail but define protocols such as TCP, IP, HTTP (for the web), and SMTP (for e-mail)</li>
<li>There are other bodies that also specify standards for network components such as network links</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org7df2604" class="outline-4">
<h4 id="org7df2604">Section 1.1.2: A Services Description</h4>
</div>
</div>
</div>

<div id="outline-container-org70215cc" class="outline-2">
<h2 id="org70215cc">Keywords</h2>
<div class="outline-text-2" id="text-org70215cc">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Host or End-System</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Segments</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Packets</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Packet Switches</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Link-Layer Switches</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Routers</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">IP Protocol</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TCP Protocol</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org5a06995" class="outline-2">
<h2 id="org5a06995">Questions</h2>
<div class="outline-text-2" id="text-org5a06995">
<ul class="org-ul">
<li><b>Q</b>:</li>
</ul>
</div>
</div>

<div id="outline-container-org08a7a40" class="outline-2">
<h2 id="org08a7a40">Summary</h2>
</div>

<div id="outline-container-orgfb60913" class="outline-2">
<h2 id="orgfb60913">Resources</h2>
</div>
</div>
</body>
</html>
